XmlTemplates/Ws-info-soap2.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-19623049">
        <wsu:Created>2006-07-25T11:32:17.015Z</wsu:Created>
        <wsu:Expires>2006-07-25T11:37:17.015Z</wsu:Expires>
      </wsu:Timestamp>
      <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-13190097">
        <wsse:Username>DEMOAIE0A0UN\etnetera</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">etnetera</wsse:Password>
        <wsse:Nonce>mp4aZDJJRGoNf1sS2zOlZw==</wsse:Nonce>
        <wsu:Created>2006-07-25T11:32:17.000Z</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <Ws-info xmlns="http://www.gordic.cz/ws/xrg-gin/v_1.0.0.0">
      <requestXml xmlns="">
        <ns1:Xrg xmlns:ns1="http://www.gordic.cz/xrg/ssl/wfl-dokument/ws-info/request/v_1.0.0.0">
          <ns1:Ws-info>
            <ns1:Typ-pozadavku>info</ns1:Typ-pozadavku>
          </ns1:Ws-info>
        </ns1:Xrg>
      </requestXml>
    </Ws-info>
  </soapenv:Body>
</soapenv:Envelope>